DEVINO.AddressBook.Api для клиентов
===================================

Описание
--------

Сервис представляет собой удобный интерфейс для управления списками контактов адресной книги  и получения списка отписавшихся 
от рассылок.

Список методов
1. Набор методов для работы с группами контактов - ContactGroups.

+------------------------------------------+------------+--------------------------------------------+
|      Ресурс                              |   Метод    |    Описание                                |
+==========================================+============+============================================+
| /ContactGroups                           |   GET      |  Получение списка всех групп               |
+------------------------------------------+------------+--------------------------------------------+
| /ContactGroups/{ContactGroupId}          |   GET      |  Получение группы с подробной информацией  |
+------------------------------------------+------------+--------------------------------------------+
| /ContactGroups                           |   POST     |  Добавление группы                         |
+------------------------------------------+------------+--------------------------------------------+
| /ContactGroups/{ContactGroupId}          |   PUT      | Редактирование группы                      |
+------------------------------------------+------------+--------------------------------------------+
| /ContactGroups/{ContactGroupId}          |   DELETE   |  Удаление группы                           |
+------------------------------------------+------------+--------------------------------------------+
| /ContactGroups/{ContactGroupId}/Contacts |   POST     |  Массовый импорт контактов                 |
+------------------------------------------+------------+--------------------------------------------+

2. Набор методов для работы с контактами - Contacts.

+-------------------------+------------+-----------------------------------------------------+
|      Ресурс             |   Метод    |    Описание                                         |
+=========================+============+=====================================================+
| /Contacts?Query={Key}   |   GET      | Получение диапазона контактов по телефону или почте |
+-------------------------+------------+-----------------------------------------------------+
| /Contacts/{ContactId}   |   GET      | Получение контакта с подробной информацией          |
+-------------------------+------------+-----------------------------------------------------+
| /Contacts               |   POST     | Создание контакта                                   |
+-------------------------+------------+-----------------------------------------------------+
| /Contacts/{ContactId}   |   PATCH    | Редактирование контакта                             |
+-------------------------+------------+-----------------------------------------------------+
| /Contacts/{ContactId}   |   DELETE   | Удаление контакта                                   |
+-------------------------+------------+-----------------------------------------------------+

3. Набор методов для работы с отписавшимися - Unsubscribed.

+-------------------------------+------------+----------------------------------------------+
|      Ресурс                   |   Метод    |    Описание                                  |
+===============================+============+==============================================+
| /Unsubscribed?TaskId={TaskId} |   GET      | Получение диапазона отписавшихся по рассылке |
+-------------------------------+------------+----------------------------------------------+
| /Unsubscribed                 |   GET      | Получение диапазона отписавшихся             |
+-------------------------------+------------+----------------------------------------------+

Запрос к API состоит из следующих элементов:
* Основного URL запроса: https://integrationapi.net/addressbook/v1
* Ресурса, например: /Contacts
* Параметров запроса в кодировке UTF-8. Сервис реализован с использованием технологии ServiceStack, что позволяет передавать 
параметры в следующих форматах: XML, JSON, JSV, CSV.

Авторизация
Для доступа к сервису необходимо пройти авторизацию. Сервис поддерживает базовую авторизацию через заголовок Authorization 
(https://en.wikipedia.org/wiki/Basic_access_authentication):

.. code-block:: json

    Authorization: Basic dGVzdGVyOjExMTExMQ==
    
В заголовке необходимо передать логин и пароль из ЛК (https://my.devinotele.com) в формате login:password в base64 кодировке.

Ответ API состоит из 2х частей:
Код с описанием - эта часть присутствует во всех ответах. В качестве описания возвращается user-friendly описание ошибки.
Result, специфичный для каждого запроса. Может отсутствовать.

.. code-block:: json

    {
        "Result":{
            ...
        },
        "Code": "validation_error",
        "Description": "user not found"
    }
    
Набор кодов ограничен, а набор описаний зависит от конкретного метода и фантазии разработчика. Код можно использовать 
для проверки статуса запроса, а описание предназначено для диагностики возможных проблем человеком. 
Описание может быть изменено в новой версии API без предупреждения о нарушении обратной совместимости. 
Набор кодов также может быть расширен.

Локализация
В поле Description может возвращаться локализованная строка с текстом ошибки. Для этого необходимо передать заголовок 
Accept-Language с нужным языком. В текущей версии поддерживаются русский и английский языки. По умолчанию, если заголовок 
не передан или язык не найден среди доступных возвращаются ответы на английском.

.. code-block:: json

    Accept-Language: ru-RU
    
Запрос диапазонов
Некоторые запросы предполагают возвращение только части данных. Для таких запросов необходимо передавать специальный заголовок:

.. code-block:: json

    Range: items=1-100
    
Оба предела диапазона включаются. Запросы, для которых нужен данный заголовок:
/Unsubscribed
/Contacts?Query={Key}
При отсутствии заголовка данные запросы возвращают ошибку validation_error с http кодом 416 RequestedRangeNotSatisfiable.

Список кодов ответов

+------------------+------------------+---------------------------------------------------------+
|      Код         | Http StatusCode  | Расшифровка                                             |
+==================+==================+=========================================================+
| validation_error | 400 - 404, 416   | Ошибки валидации, авторизации и доступа                 |
+------------------+------------------+---------------------------------------------------------+
| ok               |   200, 201, 206  | Запрос выполнен успешно                                 |
+------------------+------------------+---------------------------------------------------------+
| internal_error   |   500            | Внутренняя ошибка сервиса, можно повторить запрос позже |
+------------------+------------------+---------------------------------------------------------+

ContactGroups
ContactGroups GET (all)
https://integrationapi.net/addressbook/v1/ContactGroups 
Метод возвращает список всех групп контактов пользователя. Возвращаемый результат - список объектов типа ContactGroupDto. 
Возвращаемый результат - список записей ContactGroupDto

+----------------+------------+----------------------------------------------+
|  Параметр      | Тип данных |    Описание                                  |
+================+============+==============================================+
| ContactGroupId |   int      | Идентификатор группы                         |
+----------------+------------+----------------------------------------------+
| /Unsubscribed  |   GET      | Получение диапазона отписавшихся             |
+----------------+------------+----------------------------------------------+
| /Unsubscribed  |   GET      | Получение диапазона отписавшихся             |
+----------------+------------+----------------------------------------------+
| /Unsubscribed  |   GET      | Получение диапазона отписавшихся             |
+----------------+------------+----------------------------------------------+
| /Unsubscribed  |   GET      | Получение диапазона отписавшихся             |
+----------------+------------+----------------------------------------------+

Пример ответа:

.. code-block:: json

    {
        "Result":[
            {
                "ContactGroupId": 252,
                "Name": "snuk",
                "Description": "",
                "CreatedDate": "/Date(1426504354337-0000)/",
                "ContactsCount": 3
            },
            {
                "ContactGroupId": 331,
                "Name": "zzzzzzz04.02.2016 16:49:35",
                "Description": "AB api intgration test",
                "CreatedDate": "/Date(1454582978323-0000)/",
                "ContactsCount": 0
            }
        ],
        "Code": "ok",
        "Description": "ok"
    }
    
ContactGroups GET
https://integrationapi.net/addressbook/v1/ContactGroups/{ContactGroupId}
Метод возвращает группу по идентификатору. В качестве Result возвращается объект ContactGroupDto, описание см. выше.

 Параметры запроса 
+-----------------+------------+--------------------------------------------+--------------------+
|    Параметр     | Тип данных |    Описание                                |  Обязательнй       | 
+=================+============+============================================+====================+
| ContactGroupId  | int        | Идентификатор группы (предаётся в url)     | Да                 |
+-----------------+------------+--------------------------------------------+--------------------+

Пример ответа:

.. code-block:: json

    {
        "Result":{
            "ContactGroupId": 332,
            "Name": "new group",
            "Description": "best new group",
            "CreatedDate": "/Date(1454587881407-0000)/",
            "ContactsCount": 0
        },
        "Code": "ok",
        "Description": "ok"
    }
    
ContactGroups POST
https://integrationapi.net/addressbook/v1/ContactGroups
Метод добавляет новую группу контактов. Если группа была успешно добавлена, возвращается код "ok" и http код 201. Метод возвращает 
идентификатор группы ContactGroupId в качестве Result.
Параметры запроса
+------------+------------+----------------+--------------------+
|  Параметр  | Тип данных |    Описание    |  Обязательнй       | 
+============+============+================+====================+
|  Name      | string     | Имя группы     | Да                 |
+------------+------------+----------------+--------------------+
| Description| string     | Описание группы| Нет                |
+------------+------------+----------------+--------------------+

Пример запроса:

.. code-block:: json

    {"Name":"new group","Description":"best group"}
    
Пример ответа:

.. code-block:: json

    {
        "Result": 332,
        "Code": "ok",
        "Description": "ok"
    }
    
ContactGroups PUT
https://integrationapi.net/addressbook/v1/ContactGroups/{ContactGroupId}
 
Метод обновляет имя и описание группы, затирая старые значения, возвращается только стандартный ответ, без поля Result.
Параметры запроса

+----------------+------------+----------------------------------------+--------------+
|  Параметр      | Тип данных |    Описание                            |  Обязательнй | 
+================+============+========================================+==============+
| ContactGroupId | int        | Идентификатор группы (передаётся в url)| Да           |
+----------------+------------+----------------------------------------+--------------+
| Name           | string     | Имя группы                             | Да           |
+----------------+------------+----------------------------------------+--------------+
| Description    | string     | Описание группы                        | Нет          |
+----------------+------------+----------------------------------------+--------------+

Пример запроса:

.. code-block:: json

    {"Name":"new group","Description":"best new group"}
    
Пример ответа:

.. code-block:: json

    {
        "Code": "ok",
        "Description": "ok"
    }
    
ContactGroups DELETE
https://integrationapi.net/addressbook/v1/ContactGroups/{ContactGroupId}
Метод удаляет группу, возвращается только стандартный ответ, без поля Result.
Параметры запроса

+----------------+------------+----------------------------------------+--------------+
|  Параметр      | Тип данных |    Описание                            |  Обязательнй | 
+================+============+========================================+==============+
| ContactGroupId | int        | Идентификатор группы (передаётся в url)| Да           |
+----------------+------------+----------------------------------------+--------------+

Пример ответа

.. code-block:: json

    {
        "Code": "ok",
        "Description": "ok"
    }
    
ContactGroups POST (contacts import)
https://integrationapi.net/addressbook/v1/ContactGroups/{ContactGroupId}/Contacts
Метод импортирует пачку контактов. Если контакты были успешно добавлены, возвращается код "ok" и http код 201. 
Метод возвращает счётчики добаленных контактов в качестве Result.
Валидируются:
наличие группы, в которую импортируются контакты
максимальное количество контактов - не более 5 000
Контакты валидируются на:
наличие хотя бы одного поля - номер телефона или email адрес
валидность номера телефона, если он передан
валидность email адреса, если он передан
длина полей FirstName, MiddleName и LastName не должна превышать 100 символов, для ExtraField1 и 
ExtraField2 - ограничение 700 символов
пол, если передано значение отличное от 1 и 2, будет проставлено 3
Параметры запроса:

+-----------------------+-------------+---------------------------------------------------------------------------+--------------------+
|    Параметр           | Тип данных  |    Описание                                                               |  Обязательнй       | 
+=======================+=============+===========================================================================+====================+
| ContactGroupId        | int         | Идентификатор группы (передаётся в url), в которую импортируются контакты | Да                 |
+-----------------------+-------------+---------------------------------------------------------------------------+--------------------+
| CheckDuplicates       | int         | 0 - нет проверки на дубликаты (значение по умолчанию)                     | Нет                |
|                       |             | 1 - дубликаты проверяются по номеру телефона                              |                    |
|                       |             | 2 - дубликаты проверяются по email                                        |                    |
+-----------------------+-------------+---------------------------------------------------------------------------+--------------------+
| ContactGroupsForCheck | int[]       | Список идентификаторов групп для проверки дубликатов,                     | Нет                |
|                       |             | учитывается только если включена проверка дубликатов	                    |                    |
+-----------------------+-------------+---------------------------------------------------------------------------+--------------------+
| Contacts              |ContactDto[] | Список импортируемых контактов                                            | Да                 |
+-----------------------+-------------+---------------------------------------------------------------------------+--------------------+

ContactDto

+-------------+------------+------------------------------------+--------------+
|  Параметр   | Тип данных |    Описание                        |  Обязательнй | 
+=============+============+====================================+==============+
| DateOfBirth | DateTime   | Дата рождения                      | Нет          |
+-------------+------------+------------------------------------+--------------+
| Email       | string     | Email адрес                        | см. описание |
+-------------+------------+------------------------------------+--------------+
| ExtraField1 | string     | Дополнительное поле №1             | Нет          |
+-------------+------------+------------------------------------+--------------+
| ExtraField2 | string     | Дополнительное поле №2             | Нет          |
+-------------+------------+------------------------------------+--------------+
| FirstName   | string     | Имя                                | Нет          |
+-------------+------------+------------------------------------+--------------+
| Gender      | int        | Пол (1 - м, 2 - ж, 3 - неизвестно) | Нет          |
+-------------+------------+------------------------------------+--------------+
| LastName    | string     | Фамилия                            | Нет          |
+-------------+------------+------------------------------------+--------------+
| MiddleName  | string     | Отчество                           | Нет          |
+-------------+------------+------------------------------------+--------------+
| PhoneNumber | string     | Номер телефона                     | см. описание |
+-------------+------------+------------------------------------+--------------+

Возвращаемый результат



